import Taro from '@tarojs/taro';

const dic = {
    ERROR: {
        DEFAULT: '操作失败, 请您稍后再试~',
        10001: '参数错误，请您稍后再试~',
        10002: '参数错误，请您稍后再试~',
        10003: '登陆失效~',
        10004: '登陆失效~',
        10005: '登陆失效~',
        10006: '登陆失效~',
        10007: '系统内部错误',
        10008: '方法不存在',
        10009: '没有权限',
        10011: '用户被禁用',
        10400: '手机号无效',
        10401: '短信获取太频繁',
        10402: '验证码输入错误，请重新输入',
        14007: '获取openid失败',
        191000: '手机号码无效',
        191001: '手机号码无效',
        191001: '手机号码已经被注册',
        191003: '用户登录失败',
        191004: '验证码错误',
        191005: '用户信息错误',
        191006: '微信快捷登录失败',
        191007: '微信code无效',
        18023: '订单编号无效',
        18015: '姓名无效',
        18011: '学员照片无效',
        18019: '教练编号无效',
        18020: '教练类型无效',
        18107: '学员身份证号不正确',
        10404: '订单不存在',
        10424: '订单已完善',
        16016: '商品与年龄不匹配',
        12622: '头像重复上传',
        13004: '俱乐部验证结束时间已过期',
        12018: '没有对应年龄的商品',
        12609: '证件编号无效',
        5330019: '证件号已存在',
        20000: '系统错误',
        20001: '请求方法错误',
        30011: '用户不存在',
        30004: '学员已存在',
        51008: '时间格式错误',
        51009: '参数为空',
        10434: '姓名不能为空',
        52038: '编辑失败',
    },
    ORDER_STATUS: {
        0: '待付款',
        20: '已完成',
        30: '已取消'
    }
};


const trans = (val, key = 'ERROR') => {
    if (dic[key] && dic[key][val.errcode]) {
        return dic[key][val.errcode];
    } else if (dic[key]['DEFAULT']) {
        return dic[key]['DEFAULT'];
    } else {
        return '请您稍后再试~';
    }
};

export default trans;
